# -*- coding: UTF-8 –*-
import random
import time


# 随机生成姓名
def create_name():
    # 百家姓
    first_name = ['赵', '钱', '孙', '李', '周', '吴', '郑', '王', '冯', '陈', '褚', '卫', '蒋', '沈', '韩', '杨', '朱', '秦', '尤', '许',
                  '何', '吕', '施', '张', '孔', '曹', '严', '华', '金', '魏', '陶', '姜', '戚', '谢', '邹', '喻', '柏', '水', '窦', '章',
                  '云', '苏', '潘', '葛', '奚', '范', '彭', '郎', '鲁', '韦', '昌', '马', '苗', '凤', '花', '方', '俞', '任', '袁', '柳',
                  '鲍', '史', '唐', '费', '廉', '岑', '薛', '雷', '贺', '倪', '汤', '滕', '殷', '罗', '毕', '郝', '安', '常', '荀', '於',
                  '乐', '于', '时', '傅', '皮', '卞', '齐', '康', '伍', '余', '元', '卜', '顾', '孟', '平', '黄', '和', '穆', '萧', '尹',
                  '姚', '邵', '湛', '汪', '祁', '毛', '禹', '狄', '米', '贝', '明', '臧', '计', '伏', '成', '戴', '谈', '宋', '茅', '庞',
                  '熊', '纪', '舒', '屈', '项', '祝', '董', '梁', '杜', '阮', '蓝', '闵', '席', '季', '麻', '强', '贾', '路', '娄', '危',
                  '江', '童', '颜', '郭', '梅', '盛', '林', '刁', '锺', '徐', '丘', '骆', '高', '夏', '蔡', '田', '樊', '胡', '凌', '霍',
                  '虞', '万', '支', '柯', '昝', '管', '卢', '莫', '经', '房', '裘', '缪', '干', '解', '应', '宗', '丁', '宣', '邓', '甄',
                  '郁', '单', '杭', '洪', '包', '诸', '左', '石', '崔', '吉', '龚', '程', '嵇', '邢', '滑', '裴', '陆', '荣', '翁', '惠',
                  '乌', '焦', '巴', '弓', '牧', '隗', '山', '谷', '车', '侯', '宓', '蓬', '全', '郗', '班', '仰', '秋', '仲', '伊', '宫',
                  '仇', '栾', '暴', '甘', '钭', '厉', '戎', '祖', '武', '符', '刘', '景', '詹', '束', '龙', '叶', '幸', '司', '韶', '家',
                  '郜', '黎', '印', '宿', '白', '怀', '蒲', '邰', '从', '鄂', '索', '咸', '赖', '卓', '蔺', '屠', '蒙', '封', '芮', '羿',
                  '池', '乔', '阴', '胥', '能', '苍', '双', '闻', '莘', '党', '翟', '谭', '贡', '劳', '逄', '申', '扶', '堵', '储', '靳',
                  '冉', '宰', '雍', '郤', '桑', '桂', '濮', '牛', '寿', '通', '边', '扈', '燕', '冀', '郏', '浦', '尚', '农', '井', '段',
                  '温', '别', '庄', '晏', '柴', '瞿', '阎', '充', '慕', '连', '茹', '习', '宦', '艾', '鱼', '容', '向', '古', '易', '慎',
                  '戈', '廖', '庾', '终', '居', '步', '都', '耿', '满', '弘', '匡', '国', '文', '寇', '广', '禄', '阙', '东', '富', '巫',
                  '欧', '殳', '沃', '利', '蔚', '越', '隆', '师', '巩', '厍', '聂', '勾', '敖', '融', '冷', '辛', '游', '权', '盖', '益',
                  '那', '简', '饶', '空', '曾', '沙', '养', '须', '丰', '巢', '关', '相', '查', '后', '荆', '红', '桓', '公']
    # 名字第二个字
    second_name = [
        '秀', '娟', '英', '华', '慧', '巧', '美', '娜', '静', '淑', '惠', '珠', '翠', '雅', '芝', '玉',
        '萍', '红', '娥', '玲', '芬', '芳', '燕', '彩', '春', '菊', '兰', '凤', '洁', '梅', '琳', '素',
        '云', '莲', '真', '环', '雪', '荣', '爱', '妹', '霞', '香', '月', '莺', '媛', '艳', '瑞', '凡',
        '佳', '嘉', '琼', '勤', '珍', '贞', '莉', '桂', '娣', '叶', '璧', '璐', '娅', '琦', '晶', '妍',
        '茜', '秋', '珊', '莎', '锦', '黛', '青', '倩', '婷', '姣', '婉', '娴', '瑾', '颖', '露', '瑶',
        '怡', '婵', '雁', '蓓', '纨', '仪', '荷', '丹', '蓉', '眉', '君', '琴', '蕊', '薇', '菁', '梦',
        '岚', '苑', '婕', '馨', '瑗', '琰', '韵', '融', '园', '艺', '咏', '卿', '聪', '澜', '纯', '毓',
        '悦', '昭', '冰', '爽', '琬', '茗', '羽', '希', '宁', '欣', '飘', '育', '滢', '馥', '筠', '柔',
        '竹', '霭', '凝', '晓', '欢', '霄', '枫', '芸', '菲', '寒', '伊', '亚', '宜', '可', '姬', '舒',
        '影', '荔', '枝', '思', '丽', '昊', '强', '悦', '冰', '爽', '琬', '茗', '羽', '希', '宁', '萱',
        '昊', '芸', '天', '岚', '乾', '亦', '雅', '芝', '烨', '欣', '飘', '育', '涵', '琴', '晴', '丽',
        '美', '瑶', '梦', '茜', '倩', '希', '夕', '月', '悦', '乐', '彤', '影', '珍', '依', '沫', '玉',
        '灵', '瑶', '嫣', '倩', '妍', '萱', '漩', '娅', '媛', '怡', '佩', '淇', '雨', '娜', '莹', '娟',
        '文', '芳', '莉', '雅', '芝', '文', '晨', '宇', '怡', '全', '子', '凡', '悦', '思', '奕', '英',
        '义', '卿', '钊', '钧', '铎', '铭', '皑', '柏', '镇', '淇', '淳', '一', '洁', '茹', '清', '吉',
        '克', '先', '依', '浩', '泓', '亮', '允', '元', '源', '渊', '和', '函', '妤', '宜', '云', '琪',
        '菱', '宣', '沂', '健', '信', '媛', '凯', '伊', '欣', '可', '洋', '萍', '荣', '榕', '含', '佑',
        '明', '雄', '芝']
    # 名字第三个字
    three_name = [
        '秀', '娟', '英', '华', '慧', ' ', '巧', '美', '娜', '静', '淑', '惠', ' ',
        '珠', '翠', '雅', '芝', '玉', ' ', '萍', '红', '娥', '玲', '芬', '芳', ' ',
        '燕', '彩', '春', '菊', '兰', ' ', '凤', '洁', '梅', '琳', '素', '云', ' ',
        '莲', '真', '环', '雪', '荣', ' ', '妹', '霞', '香', '月', '莺', '媛', ' ',
        '艳', '瑞', '凡', '佳', '嘉', ' ', '珍', '贞', '莉', '桂', '娣', '琼', ' ',
        '叶', '璧', '璐', '娅', '琦', ' ', '妍', '茜', '秋', '珊', '莎', '晶', ' ',
        '锦', '黛', '青', '倩', '婷', ' ', '婉', '娴', '瑾', '颖', '露', '姣', ' ',
        '瑶', '怡', '婵', '雁', '蓓', ' ', '纨', '仪', '荷', '丹', '蓉', '眉', ' ',
        '君', '琴', '蕊', '薇', '菁', ' ', '梦', '岚', '苑', '婕', '馨', '瑗', ' ',
        '琰', '韵', '融', '园', '艺', ' ', '咏', '松', '卿', '聪', '澜', '飘', ' ',
        '纯', '毓', '悦', '昭', '冰', ' ', '爽', '琬', '茗', '羽', '希', '宁', ' ',
        '欣', '育', '滢', '馥', '筠', ' ', '柔', '竹', '霭', '凝', '晓', '欢', ' ',
        '霄', '枫', '芸', '菲', '寒', ' ', '伊', '亚', '宜', '可', '姬', '舒', ' ',
        '影', '荔', '枝', '思', '丽', ' ', '泰', '晨', '辰', '善', '厚', '庆', ' ',
        '磊', '民', '友', '裕', '河', ' ', '哲', '江', '超', '炎', '德', '彰', ' ',
        '征', '律', '若', '鸣', '朋', ' ', '斌', '梁', '栋', '维', '启', '克', ' ',
        '伦', '翔', '旭', '鹏', '泽', ' ', '朗', '伯', '昮', '晋', '晟', '诚', ' ',
        '先', '敬', '震', '振', '壮', ' ', '会', '思', '群', '豪', '心', '邦', ' ',
        '承', '乐', '宏', '言', '旲', ' ', '旻', '昊', '光', '天', '达', '安', ' ',
        '岩', '中', '茂', '进', '林', ' ', '有', '坚', '和', '彪', '博', '泰', ' ',
        '盛', '振', '挺', '掣', '明', ' ', '永', '健', '世', '广', '志', '义', ' ',
        '兴', '良', '海', '山', '仁', ' ', '波', '宁', '行', '时', '志', '忠', ' ',
        '思', '利', '清', '飞', '彬', ' ', '富', '顺', '信', '子', '杰', '涛', ' ',
        '昌', '成', '康', '星', '翰', '绍', '功',

    ]
    first = random.choice(first_name)
    second = random.choice(second_name)
    three = random.choice(three_name)
    people_name = first + second + three
    return people_name

while True:
    try:
        enter_number = int(input('请输入生成姓名个数：'))
        break
    except ValueError:
        print("输入有误请重新输入==>[整数数字]")
        continue
day_time = (time.strftime('%m{}%d{} %H:%M:%S', time.localtime()).format("月", "日"))
with open(day_time + '姓名.txt', 'w', encoding='utf-8') as f:
    for i in range(enter_number):
        person_name = create_name()
        f.write(person_name)
        f.write('\n')
    f.close()
    print("-------------正在生成中,请稍等两秒---------------")
    time.sleep(2)
    print(
        """
    | |            | |                    
    | |            | |  ( )               | |  / /
    | |       ___  | |_ |/  ___     ___   | | / / 
    | |      / _ \ | __|   / __|   / _ \  | |/ /
    | |____ |  __/ | |_    \__ \  | (_) | | |\ \ 
     \____/  \___|  \__|   |___/   \___/  | | \ \ 
                                          | |  \ \                                                                                                                                                                    

    """
    )

