# -*- coding: UTF-8 –*-
import random
from datetime import datetime

"""This is a random address function"""


def address():
    # 小区名,可自行添加
    area_address_name = ['蓝湾上林院', '绿城金华御园(别墅)', '紫金湾', '玫瑰星城', '绿城兰园',
                         '龙庭一品', '江山风华', '中梁首府', '中梁首府', '都市豪园',
                         '光明湖海城市花园', '金色海塘', '天御花园', '广润翰城', '泰地金水湾',
                         '新纪元香湖', '绿城金都美地', '中天学府诚品', '金都美苑', '金都美苑',
                         '香格里拉城市花园', '广天九龙玉府', '中天公元诚品', '南岸名城', '欧景名城',
                         '御园(东区)', '蝶景湾御江山', '滨江金色蓝庭', '书香名邸', '蓝湾国际花园',
                         '丽州一品', '丽州一品', '苏桂院(一期)', '环球春江花园', '冠达东方兰庭',
                         '五星清华园', '鸿基彼岸', '东方明珠花园', '华庭常青墅', '四季尊域',
                         '尖峰郦园', '金地艺境', '保集蓝郡', '保集蓝郡', '泰瑞家园',
                         '泰瑞家园', '和信花园', '环球春江花园', '矿泉花园', '环球春江花园',
                         '福林花园', '海韵嘉园', '万科青岛小镇', '中海蓝庭', '城发长江瑞城',
                         '麦岛金岸', '城建湖光山色', '青岛印象山', '金帝山庄', '保利海上罗兰',
                         '东海路9号', '鲁商蓝岸丽舍', '瑞源名嘉汇', '中海清江华府', '万科魅力之城',
                         '中央国际', '湛园海德公园', '万达悦公馆', '万科如园', '和达璟城紫御',
                         '上实海上海', '温哥华花园', '金秋泰和郡', '海信珠山小镇', '海逸天成',
                         '青特小镇', '中海银海一号', '万科春阳花园', '山水名园二期', '晓港名城(五期)',
                         '浮山后四小区', '万丽海景', '浮山湾花园', '深蓝中心', '万科翡翠长江',
                         '青铁华润城', '左岸风度', '逍遥花园', '鲁商首府', '鲁德海德堡',
                         '海尔山海湾', '龙湖悠山郡', '保利百合花园', '浮山后六小区', '锦绣天成',
                         '万科金色城市', '海尔世纪公馆', '青特赫山', '丽泽花园', '万科城',
                         '御景峰', '柏悦华府', '依云曦城', '上林一品', '蔚蓝创新天地',
                         '融创御府', '广佛颐景园', '荔园新天地', '友谊大街18号街坊', '星海岸',
                         '金地天玺', '翠湖绿洲', '梧桐苑', '弘信山庄', '中海临安府',
                         '东逸湾(别墅)', '世纪华庭', '宝翠花园', '龙光水悦龙湾', '藏珑华府',
                         '半岛碧桂园', '都市豪园', '仙湖别墅', '惠景城', '雅居蓝湾',
                         '尚观嘉园', '阳光山色', '青春小区', '颐山源墅', '颐和国际',
                         '致越优城', '优山美地', '保利海德公园', '星湖湾', '影都学府',
                         '绿岛明珠', '天台山庄', '时代领峰', '国际城名苑', '保集半岛',
                         '保利东御花园', '碧桂园翡翠湾', '保利西雅图', '中恒海晖城', '嘉乐花园',
                         '金海岸花园', '绿地未来城', '尚辉苑', '南江壹号', '南江壹号',
                         '长华国际中心', '丽日豪庭', '北滘海琴水岸', '万科沁园', '丽泽花园',
                         '永盛新阳光', '柳湖花园', '山水庄园', '御景花园', '南江名郡',
                         '紫金玉澜', '长信东海银湾', '丹灶碧桂园', '青春小区', '青春小区',
                         '名汇浩湖湾', '广夏花园', '海琴湾', '保利东景花园', '新城云昱',
                         '天悦湾花园', '美的翰湖苑', '招商臻园', '荟景豪庭', '如意花园',
                         '同济广场', '金地悦荔', '岭南天地璟廷', '龙光水悦云天', '江山瑞城',
                         '红星天悦', '保利外滩一号', '金地九珑璧', '碧桂园钻石湾', '泰地世锦园',
                         '光明花半里', '新君汇花地湾', '鹿璟村', '美的领贤公馆', '君御花园',
                         '恒大帝景', '帝景蓝湾', '雅丽豪庭', '红星天悦', '鲁能公馆',
                         '凤起兰庭', '珠水豪庭', '花苑广场', '雅瑶绿洲', '顺德居小区',
                         '保利花园(六期)', '鼎太风华', '馥室成双(一期)', '二冶小区街坊', '鹿港小镇',
                         '自由路8号街坊', '恒大华府', '保利罗兰香谷', '保利拉菲公馆(二三期)', '滨海名都',
                         '东河国际商住城', '日月豪庭', '光辉佳苑', '文雅苑', '迎宾小区',
                         '万达广场万达小区', '中冶世家', '景苑花园', '保利花园(三期)', '青福新城',
                         '东方俪城', '富力城(EFG区)', '丰盈小区', '富强路七号街坊', '居然新城',
                         '锦尚国际', '奥宇新城', '阿尔丁小区', '三江尊园', '现代城',
                         '文馨苑', '新星壹品', '邻圃道街坊', '惠民小区(昆都仑)', '正翔国际枫景苑',
                         '新星美地', '维多利华府', '口岸花苑', '凡尔赛颐阁(凡尔赛观邸)', '友谊17号街坊',
                         '欧风丽景', '保利花园(一期)', '欧鹿生活城', '文脉苑', '东亚香堤丽舍',
                         '乌兰小区', '佳园小区', '富强路十号街坊', '阳光小区', '翡丽湾',
                         '檀香湾', '维多利摩尔城', '恒大名都', '友谊大街22号东街坊', '文博苑',
                         '青山路1号街坊', '京奥港花园', '凯旋豪庭', '六合新城(二区南)', '富丽佳园',
                         '绿地国际花都', '景富家园(C区)', '中建御澜世家', '阿南小区', '松石国际城石榴花园',
                         '中冶世家水晶城', '华丽家族', '美室层双', '松石名第', '燕赵锦河湾',
                         '牡丹花园', '友谊小区(南区)', '合志家', '园文芳苑', '山水佳苑',
                         '万郡大都城', '华发新城', '包钢友谊十三小区', '丽晶名邸', '金茂豪庭',
                         '少先路31号街坊', '百兴小区', '佳福小区', '首创加州郡府', '锦林花园',
                         '昆河壹号', '馥室成双(二期)', '青山路五号街坊', '恒基景苑', '振华二区',
                         '紫金华府', '保利花园(二期)', '富强路一号街坊', '健康新城', '望园小区',
                         '嘉园泊景湾', '新元华庭', '金沙华府', '育才小区', '龙熙盛景',
                         '呼得木林大街10号街坊', '青东华庭', '黄河小区', '呼得木林大街11号街坊', '中冶世家华庭',
                         '明日星城知情苑', '富力华庭', '锡华世纪花园', '自由路7号街坊', '保利花园(四期)',
                         '水岸花都', '鹿鸣苑', '青年路8号街坊', '龙苑小区(B区)', '富贵佳园',
                         '高新花园', '丰景佳苑', '荣资梦乡', '胜达小区', '检察馨苑',
                         '青山路六号街坊', '居然青年城', '少先路二十二号街坊', '大连新型居住区温馨园',
                         '保利拉菲公馆(一期)',
                         '桐荷嘉苑', '远洲国际城', '青11号街坊', '广基花园', '茂业天地',
                         '和发紫薇园', '城际美景', '丰景御苑', '裕民新城理想城', '东方花园',
                         '天疆骊城', '纺织社区', '惠德花园', '海威小区(二区)', '青松小区(二区)',
                         '铭峰佳苑', '景富家园(B区)', '颐和山庄', '大连新型居住区春意园', '鹿景苑',
                         '青云小区一段', '阳光尚品(南区)', '滨江国际阅江台', '融茂第一城(C1区)', '意城晶华',
                         '富强路三号街坊', '友谊大街19号街坊(一区)', '大连新型居住区长熙园', '幸福路7号街坊',
                         '华天云居',
                         '振翔小区', '神华佳苑', '幸八雅园', '当代左岸绿洲', '江南文枢苑',
                         '滨江国际澜泊湾', '丰产道一号街坊', '青年路10号街坊', '明日星城知乐苑', '新星水岸花园',
                         '北梁新区南二区', '幸福路5号街坊(哈达道)', '向阳花苑', '青年路7号街坊', '闽辉禧瑞都',
                         '友谊大街27号街坊', '瀚星华府', '龙昱华府', '景富家园(F区)', '友谊嘉园(三期)',
                         '怡然苑', '南排小区', '赛音小区(西区)', '天赐新城(B区)', '万达嘉园',
                         '金泰花园', '明日星城德景苑', '通顺东二区', '当代菁英国际', '友谊大街25号街坊',
                         '呼得木林大街7号街坊', '加州郡府融邦', '万新家园', '民馨家园(二区)', '呼得木林新天地2区',
                         '北大恒苑', '万和城(二期)', '东豪国际城', '自由路5号街坊', '明日星城知雅苑',
                         '钢铁大街36号街坊', '海威小区(五区)', '呼得木林大街14号街坊', '西五街房管楼小区(体育场南路)',
                         '碧水嘉苑',
                         '巨力时代', '民主路5号街坊', '汇金小区', '景晟开元', '瑞春园',
                         '金辉华府', '恩和小区', '喜瑞都御府', '钢铁大街18号街坊', '国际新城(南区公寓)',
                         '电力佳苑', '健康阳光城(北区)', '和平路西小区', '祥和苑', '幸福路1号街坊',
                         '龙苑小区(A区)', '北梁新区南四区', '鑫泰豪庭', '天福广场', '友谊大街23号街坊',
                         '海威小区(四区)', '银苑小区', '康乐小区(西区)', '中晟华悦', '保利香槟湾(保利香槟花园)',
                         '兵工华居', '西河景苑', '都兰小区', '友谊大街16号街坊', '公园大道',
                         '自由路4号街坊', '中冶世家荣园', '园林新村', '内蒙古地勘五院', '恒大帝景',
                         '苏宁广场', '朝阳小区(一区)', '佳禾公寓', '滨江国际王俯景', '青松小区(五区)',
                         '一化小区', '民馨家园(六区)', '瑞芬小区', '青年园', '核工业208小区',
                         '沃土阳光住宅小区', '春光小区(六区)', '华清佳苑', '瑞德花园', '北梁新区西一区',
                         '万和城(一期)', '明华学府', '青年路12号街坊住宅小区', '呼得木林大街12号街坊', '少先20号街坊',
                         '友谊大街22号西街坊', '松石国际城', '中和文化广场', '大连新型居住区逸民园', '振华小区',
                         '九郡嘉园', '世纪佳苑', '民主路3号街坊', '富强路十二号街坊', '西四街小区',
                         '夏日花园', '宏源鑫都', '明日星城安景苑', '幸福南路16号街坊', '青松小区(六区)',
                         '龙藏新城福地园', '大连新型居住区怡生园', '钢铁大街37号街坊', '锦绣嘉园', '融茂第一城(A区)',
                         '矿机小区', '保成上元名府(南区)', '幸福路2号街坊', '幸福路10号街坊', '青宾小区',
                         '矿办小区', '金泰丽苑', '民馨家园A区', '海湖豪庭', '赛音道五号街坊',
                         '西脑包康乐小区', '璟华苑', '三电住宅小区', '时代天骄', '明日星城知书苑',
                         '通顺西二区', '友谊小区(北区)', '山水文苑', '富强路四号街坊', '呼得木林新天地1区',
                         '当铺佳苑', '香林美地', '华丰园', '鹿城福满园', '明日星城文景苑(北区)',
                         '青苑小区', '公二街住宅小区', '春阳小区', '边防佳苑', '九中小区',
                         '鹿苑小区', '丰产道2号街坊', '绿都花庭', '顺鑫望潮苑(别墅)', '绿苑豪庭',
                         '傲北上城', '胜源滨河新城', '御融公馆(公寓住宅)', '青年路18号街坊', '总部经济园',
                         '田城康都苑', '赛音道六号街坊', '中慧新城', '美岸华庭(北区)', '呼得木林大街9号街坊',
                         '友谊大街26号街坊', '海威小区十区', '电力小区(青山)', '南海五村', '警官花园',
                         '信德雅居', '神力龙园', '怡景园', '三克拉', '天赐新城(A区)',
                         '贵发山庄(一期)', '步步高东苑', '朝阳小区(二区)', '太阳城', '青年路14号街坊',
                         '绿苑小区(东河)', '颐和山庄(半山湖)', '友谊大街31号小区', '安富小区', '天安雅居',
                         '草原小区', '青六新苑', '青云二段', '团结大街11号街坊', '新春小区',
                         '兵工佳苑', '胜达花苑', '福宇小区', '新桃园小区', '西一街小区',
                         '兰溪花园', '金桂名园', '福泰嘉苑', '安泰华庭', '保利钻石小区',
                         '迎宾道一号街坊', '幸福路9号街坊', '东方嘉苑', '永茂泉阳光小区', '横泰佳苑',
                         '明德花园(公寓住宅)', '少先路29号街坊盛世嘉苑', '友谊大街15号街坊', '御景华庭',
                         '团结大街8号街坊',
                         '自由路10号街坊', '青松小区(七区)', '北新街小区(北新苑东区)', '怡荷豪庭', '信合龙湾半岛',
                         '曹欣小区', '北梁新区西二区', '赛音道一号街坊', '健康阳光城(南区)', '光辉小区(三区)',
                         '古邑人家', '近水楼台', '龙藏新城雅典苑', '东海花园', '景富家园(A区)',
                         '国际新城(北区)', '工业路2号街坊', '松石雅居', '钢铁大街24号街坊', '锦裕园小区',
                         '青甲12号街坊', '团结22号街坊', '景天花园(一期)', '龙丰苑', '保利公园壹号',
                         '海威小区(六区)', '攀宇小区', '宁馨佳园', '丰产道3号街坊', '方兴观澜壹号']
    # 随机选择小区名
    area_name = random.choice(area_address_name)
    # 随机选择楼栋
    build_number = str(random.choice(
        [1, 2, 3, 5, 6, 7, 8, 9, 10, 11, 12, 13, 15, 16, 17, 18, 19, 20, 21, 22, 23, 25, 26, 27, 28, 29, 30, 31, 32])
    )
    # 随机选取单元号
    unit_number = str(random.choice(
        [1, 2, 3, 5, 6, 7])
    )
    # 随机选择楼层号
    floor_number = str(random.choice(
        [1, 2, 3, 5, 6, 7, 8, 9, 10, 11, 12, 13, 15, 16, 17, 18, 19, 20, 21, 22, 23, 25, 26, 27])
    )
    # 随机选择门牌号
    house_number = str(random.choice(
        [1, 2, 3])
    )
    result_address_name = demo + area_name + build_number + "号" + unit_number + "单元" + floor_number + "0" + house_number + "室"
    return result_address_name


"""this is persion input function"""
str1 = "龙洞堡御景新城大田大道"
str2 = "水川镇转青城镇西巴路"
print("##########请勿乱分享，珍惜劳动付出，谢谢！！！！")
while True:
    print("*  1 : 龙洞堡御景新城大田大道")
    print("*  2 : 水川镇转青城镇西巴路")
    while True:
        try:
            persion_input = int(input('请输入地址头对应的数字：'))
            break
        except ValueError:
            print('!!!!输入有误请重新输入==>[1或者2]!!!')
            continue
    if persion_input == 1:
        demo = str1
        print("==> 需要生成的地址前标记为：  " + demo)
        break
    elif persion_input == 2:
        demo = str2
        print("==> 需要生成的地址前标记为：  " + demo)
        break
    else:
        print('您输入的不正确，请重新输入')
        continue
while True:
    try:
        enter_number = int(input('请输入生成地址个数：'))
        break
    except ValueError:
        print("输入有误请重新输入==>[整数数字]")
        continue
nt = datetime.now()
day_time = nt.strftime('%Y{y}%m{m}%d{d} %H{h}%M{mm}%S{s}').format(y='年', m='月', d='日', h='时', mm='分', s='秒')

"""This is a Main function"""
with open(day_time + "地址.txt", "w", encoding='utf-8') as f:
    for i in range(enter_number):
        person_address = address()
        f.write(person_address)
        f.write('\n')
    f.close()
print(
    """
 _              _    _                        
| |            | |  ( )                       
| |       ___  | |_ |/  ___    __ _    ___   
| |      / _ \ | __|   / __|  / _` |  / _ \  
| |____ |  __/ | |_    \__ \ | (_| | | (_) | 
\_____/  \___|  \__|   |___/  \__, |  \___/  
                               __/ |         
                             |___/                                                                                                                                                                                         
"""
)
